window.encodedWardPaths = [["åùèØÖĢ","åçÕØÖö","åÕÛ×ġĔ","åÕĕ×ñÌ","äëè×ïċ","äïÓ×ÿĐ","äÌØ×ĞÍ","äËøØëÑ","ãæ×Øèĕ","âĢå×Ěğ","áĝþ×ĘÏ","áĝÐØÌ÷","áāĖØËĕ","áāðØäã","áÓĢØãÒ","áËĉ×ĕĤ","áÔĒ×ĖØ","áÕė×Øī","áçī×Ùû","áèêÖĥÏ","áúąÖĥĀ","áùĪ×æß","áĕË×æĩ","áĔĈ×ÿñ","âĂğ×āĒ","âĄôÖĄÉ","âĩïÖĄĪ","âĩõÖçÈ","áģĎÕĜĠ","áĠÎÖßû","áĎëÕħī","áčďÖéÓ","áòõÖèê","áòğÖÏğ","á×ĂÖÏĐ","á×ÝÖçă","àĖĒÖæü","àčħ×ãĨ","àĞÜ×äñ","àĜċØâæ","àĥēØâÿ","àĥāØûÒ","áÓćØûĒ","áÓùØĔð","áåĄØĔĝ","áåĚØüÚ","áøÉØüć","á÷æÙâĂ","áĒñÙãß","áĊßØýÓ","áĚÖØäğ","âÝÖØåĢ","âïÖØþĩ","âāñØÿê","âĀõÙù÷","âĥĠÙúĄ","âĦûÙåĈ","äÜĕÙéç","äÝćØëĔ","äèéØìÒ","äğĞÙë×","åøðÙìĢ","åùÏØíĖ","åĂÕØîÎ","åĂòØ×Ö","åùèØÖĢ"],["ßĤÞÙÞâ","àÌå×âÎ","ßþĄ×àė","ßčĞÕĖï","ßçāÕĕý","ßèïÕäğ","ßĎćÕæÑ","ßďĝÔÿĈ","ßÝÊÔòë","ßÝïÔ×Ď","ßĐñÔÚĉ","ßĐċÓīĦ","ßăĚÓħæ","ßđÏÓĎĄ","ßđĥÒĨģ","ßëĊÒħĨ","ßíėÑĉô","ÞĞĄÑĈĄ","ÞğôÑÜħ","ÞóöÑÜė","ÞíÿÐĞð","ÞÞÈÐĝÿ","ÞâĝÐáó","ÞÚďÐÖĖ","ÝĩÝÐêö","ÝĒüÐÚĠ","ÝÿãÐÚè","ÝþÍÐåï","ÜĠÎÐßĖ","ÜĤÙÐāĈ","ÞÕÔÐć÷","ÞÔĢÐĝì","ÝĠÚÐĥÏ","ÝāĥÐĘÙ","ÝàÑÐġÏ","ÜĉÑÐûï","ÜÑóÐôę","ÜÓèÑćø","ÛĒČÑĆú","Ûē×Ñêó","ÚåÊÑòÌ","ÚäēÑćî","ÛÉċÑĈĠ","ÛÉĠÑüĖ","ÛîäÑĉË","ÛíĀÒÛÚ","ÜĩÊÒÞÍ","ÜĩçÑĩÚ","ÝéáÑĪÈ","ÝéÊÒÖĖ","ÝĖĖÒ×Ĝ","ÝđāÒąÜ","ÝÿČÒąç","ÝþÉÔËë","ÞâçÔÎê","ÞâÉÔãĝ","ÞĩĞÔåĦ","ÞĨ÷ÖàĊ","ÞĎēÖßĪ","ÞďÑÖÈÙ","Þ÷øÕīó","ÞøÓÕăĖ","ÞĊĚÕăī","ÞċăÕâĚ","ÞàôÕáø","ÞáàÔĔĜ","ÝġÙÔĕÏ","ÝĠčÕÞě","ÝûĈÕþî","ÝøĖ×ôò","ÝĜÎ×ôĔ","ÝĠù×ĥď","ÞÜĦ×Ħā","ÞÝå×ĎÑ","Þòå×Ď÷","ÞčÈ×îô","Þčá×Þû","ÞĦĢ×ßß","ÞĥĒ×Ĩø","ÞČÔ×ħğ","ÞĀĔØôî","ÞĉĜØôą","ÞĉăØĎÝ","ßîóØđÝ","ßîÙØĨü","ßÖÿØħę","ßÖäÙÜÜ","ÞĥąÙÛđ","ÞĤćØħõ","ÞĉéØĦõ","ÞÿđÙóÙ","ÞĈěÙóñ","ÞĈÿÙċģ","ßäàÙčē","ßäĀÙõÈ","ßíÏÙõÓ","ßíçÙčĪ","ßĈđÙĎē","ßĈøÙħä","àÐĔÙĨÿ","àÑĂÙÞđ","ßĤÞÙÞâ"],["ÝđúÒ×Ď","ÜĩçÑĩÚ","ÜĩÊÒÞÍ","ÛíĀÒÛÚ","ÛîäÑĉË","ÛÉĠÑüĖ","ÛÉċÑĈĠ","ÚäēÑćî","ÚåÝÑåï","ÙĤęÑäĈ","ÙĥîÐĜģ","ÙÝæÐīā","ÙÝýÐğá","ÙËíÐĞĈ","ÙÌÖÐñĞ","ØĝĨÐñõ","ØĝĎÐāė","ØċýÐāê","ØċãÐđĊ","ØÔúÐĜþ","ØÓġÑßć","×ĥčÑßÛ","×ĦæÐĜÕ","×ēĪÐěĎ","×ēúÑÛĖ","ÖĥčÑÚá","Öĩ÷Ò×Ă","ÖþðÒÖø","ÖĆñÓìç","ÖáĪÓëæ","ÖáÖÓĜÉ","ÖėÐÓĝ÷","ÖėçÔÑĘ","×èġÔÓ×","×èĀÔëĆ","×ĩâÔíÖ","×ĩËÔąñ","ØàÛÔĆÒ","ØÞĦÕăá","ØñØÕăđ","ØðåÖèĆ","ØĔĈÖéĕ","ØĖÙÕÓÕ","ØñęÕÓÏ","ØóÓÔÖÍ","ØÎĉÔÕÐ","ØÐêÓĈĨ","ØóīÓĉö","ØôĦÓØñ","ÙĢèÓÜè","ÙĢćÒĨæ","ÚãÔÒĩÑ","ÚãäÒĜĦ","ÚćēÒĕË","ÚĈÚÒþä","ÝđāÒąÜ","ÝđúÒ×Ď"],["ÜÓÊÑæĕ","ÜÎÏÐ÷ø","ÛùăÐåĆ","ÛðĚÐÜß","ÛüĔÐÈü","ÛïĪÐÜÊ","ÚĤóÐÏë","ÚÙģÏìÞ","ÙĒÔÏãÏ","ÙíĢÎĜě","ØġćÎăË","ØđÉÎèØ","ØâĆÎÒá","×ĤěÍăÕ","×ûáÍąą","×úÓÎçč","×ÎèÎêØ","×ÎøÎúĕ","×ÜöÎøħ","×ÍďÎęē","×ÐÏÏÿ×","×øĎÏĀÏ","×øûÏďđ","×ÛèÏďÍ","×ÛÖÏĞä","×ăÙÏĪÏ","×ĂęÐÞÜ","×ÌÔÐÜĚ","×ÌÚÐèú","×ðďÐíę","×ïĀÐĩĨ","×ÊĎÑÍĐ","×ÊøÑÚø","×ēúÑÛĖ","×ēĪÐěĎ","×ĦæÐĜÕ","×ĥčÑßÛ","ØÓġÑßć","ØÔúÐĜþ","ØċãÐđĊ","ØċýÐāê","ÙÌÖÐñĞ","ÙËíÐĞĈ","ÙÝýÐğá","ÙÝħÐīĆ","ÙĥîÐĜģ","ÙĤęÑäĈ","ÚåÝÑåï","ÚåÊÑòÌ","Ûē×Ñêó","ÛĒČÑĆú","ÜÓèÑćø","ÜÓÊÑæĕ"],["×ìÊÏĩĄ","×ÛÖÏĞä","×ÛèÏďÍ","×øûÏďđ","×øĎÏĀÏ","×ÐÏÏÿ×","×ÌĪÏïĉ","×ÍďÎęē","×ÜñÎþĪ","×ÎøÎúĕ","×ÎèÎêØ","×úÓÎçč","×ûáÍąą","×àīÍñĄ","×ßØÍÖĠ","×ÑØÍÔĒ","ÖĪĄÍöì","ÖĒěÍþħ","ÖðÙÍÝğ","ÖíõÍìâ","ÕĢĪÍÛċ","ÕċôÌÿú","ÕĎÿÌòĈ","ÖÈôÌéī","ÕčĞÌñđ","ÕõĂÍÎÊ","ÕÔèÍÑÒ","ÕÕáÌĖË","ÕíýÌĤä","ÕöēÌęÍ","ÔĒđËĦø","ÔôøËĚÍ","ÔîôËćĦ","ÔöâËþË","ÔÜÕËþæ","ÔÙĉÌßû","ÓĘýÌëè","ÓĘÖÌďč","ÓóęÌďÕ","ÓóßÍÜÑ","ÓąôÍÜù","ÓĄħÍćî","ÓĩìÍĈÝ","ÓĩÌÍĦĥ","ÔÖúÍħò","ÔÖïÎÎð","ÓĖđÎÍû","ÓĖāÎÜī","ÒčýÎØģ","ÒčÙÎîĦ","ÔÔęÐîñ","ÔÕØÐÖþ","ÕÌÏÐØĔ","ÕÍĪÎ÷Ï","ÕòÛÎ÷ī","ÕòØÎÞğ","ÕĄĊÎßá","ÕĄåÎÿġ","Ö×čÎùù","ÖÕÝÐÛÌ","×ĂęÐÞÜ","×ăÙÏĪÏ","×ìÊÏĩĄ"],["ÔĚßÒâè","ÔęďÒÑħ","ÔöñÒÐÑ","ÔøãÐħĦ","ÔĄúÐĘú","ÔøýÐćĜ","ÔĝáÐüĕ","ÔĝĊÐäĢ","Ôċ÷Ðäú","ÔċčÐ×Ħ","ÔÕØÐÖþ","ÔÔęÐîñ","ÓĕÌÏĠă","ÓĔĨÏĩĥ","ÒċĆÏĞà","ÒĉćÐÓÌ","ÐåęÐÌđ","ÐäĪÐýÔ","ÐÒħÐüè","ÐëéÑÉđ","ÏđïÑÈÒ","ÏĎĄÐÜß","ÏĄćÐÍü","ÏÌĨÐÙĉ","ÎĥĞÐëĆ","ÎġíÑñö","ÏÓĜÑğú","ÑģÊÒÉī","ÑĢĚÒÖĨ","ÒīīÒåĘ","ÒīÿÒþÑ","ÓĢăÒÿħ","ÓĠÓÔÖõ","ÔėÊÔØĘ","ÔėÛÔÌĈ","ÔĩòÔÍÓ","ÕÈÒÒíâ","ÔĚßÒâè"],["ÒÉđÊÚÝ","ÒÉýÊíĒ","ÑĉãÊöÎ","Ñ÷äÊÔã","ÐĤ÷ÊØØ","ÐĤÓÊäá","ÐĤÒÊôā","ÑäėÊëē","ÑäĄÊ÷Ü","ÑēæÊđĝ","ÒÛîÊĆí","ÒÈğÊĞä","ÒÈïËÞĔ","ÑĚÜËÞó","ÑĚíËÒé","ÑõīËÑē","ÑõĜËÝġ","ÐþąËÔĐ","ÐÿÌÊĝÎ","ÐçĦÊĜù","ÐÚìÊīÈ","ÐÙĪËáĄ","ÏęøËàď","ÏęÉËāċ","ÎĐÚËÿĦ","ÎďçÌä÷","ÎýÏÌäØ","ÎýÕÌĂé","ÎêēÌüÞ","ÎêØÌĥĀ","ÏĀĨÎÐ×","ÏĕĞÎÑĦ","ÏĞęÌĠÖ","ÐĠĢÌĢĎ","ÐġġÌÙę","ÑīÐÌÛĤ","ÑĪĥÌèÑ","ÒýõÌèġ","ÒüīÌčô","ÓáùÌďÈ","ÓĘÖÌďč","ÓĘýÌëè","ÔÙĉÌßû","ÔÙüËĆñ","ÓĚāËêč","ÓòôÊøć","ÓôÖÊÞç","ÓÿăÉĩÜ","ÓĄĥÊßă","ÓĄĨÊÉĤ","ÓãØÉĈĈ","ÓÎĚÉĪä","ÒĔċÉĥĂ","ÒêÍÈċė","ÒÍÈÈćÕ","ÒÉđÊÚÝ"],["ÓĪĖÍĦĪ","ÓĩìÍĈÝ","ÓĄħÍćî","ÓąôÍÜù","ÓóßÍÜÑ","ÓóęÌďÕ","ÒüīÌčô","ÒýõÌèġ","ÑĪĥÌèÑ","ÑīÐÌÛĤ","ÐġġÌÙę","ÐĠĢÌĢĎ","ÏĞęÌĠÖ","ÏĕĞÎÑĦ","ÎĊĩÎÌħ","ÎèÝÎØÕ","ÎäĘÐßĝ","ÏĒħÏĢù","ÏĒģÐËù","ÒĉćÐÓÌ","ÒċĆÏĞà","ÓĔĨÏĩĥ","ÒčÙÎîĦ","ÒčýÎØģ","ÓĖāÎÜī","ÓĖđÎÍû","ÔÖïÎÎð","ÔÖúÍħò","ÓĪĖÍĦĪ"],["ÐÖÝÐĂģ","ÐäĪÐýÔ","ÐåęÐÌđ","ÏĒģÐËù","ÏĒħÏĢù","ÎäĘÐßĝ","ÎçÒÎěþ","ÎÛøÎĘÕ","ÍĜđÎĜü","ÌÔĜÏēğ","ËËéÏďö","ÈăċÍĈâ","ÈÉòÍòô","ÈÈçÑæě","ÈāßÑæĩ","ÈćéÑąě","ÉõüÑëĕ","ÉõÑÑÿû","ÉĉĠÑāà","ÉĖąÑėÊ","ÉĕÎÒÊĢ","ÉèĘÒčò","ÉäÊÓÓÊ","ÉìÊÓÓÓ","ÉîöÓ÷á","ÊßčÓúÌ","ÊàĩÒñě","ËêÎÒõä","ËêđÑĝá","ÎâÔÑĥĢ","ÎàÔÓúĂ","ÎĨĨÓüü","ÏÉÜÑĤĕ","ÏÓĜÑğú","Îġ×ÑïĀ","ÎĨØÐåë","ÏĄćÐÍü","ÏĎĄÐÜß","ÏđïÑÈÒ","ÐëéÑÉđ","ÐÖÝÐĂģ"],["ÒÉģÊÕï","ÒÍÒÈćÑ","ÑčÕÈāÒ","ÑčáÈËá","ÑĈĎÉāÚ","ÑĄĈÈāÜ","ÐĖàÈýĂ","ÐĉúÈÍü","ÏđþÈËæ","ÏøĤÈÖĐ","ÏäĄÈËè","ÏâĥÈàČ","ÏÐėÈõċ","ÎĖÓÈßù","ÎğĜÈÒæ","ÎĆĄÈòď","Î÷ĚÈÈÈ","ÎùĨÈÜě","ÎïïÈËī","ÈÈÈÈÒå","ÈÉûÍòð","ÈăĔÍĈÞ","ÊħĝÏċĐ","ÌÔĥÏēě","ÍĞéÎěĚ","ÎçÜÎěú","ÎèçÎØÑ","ÎðĐÎÓÛ","ÏāÍÎÐÓ","ÎêáÌĥü","ÎêĝÌüÚ","ÎýÞÌĂæ","ÎýÙÌäÔ","ÎďðÌäó","ÎĐäËÿĢ","ÏęÓËāć","ÏęāËàċ","ÐÚÐËáĀ","ÐÚöÊĪĨ","ÐèËÊĜõ","ÐÿÖÊĝÊ","ÐþĎËÔČ","ÑõĥËÝĝ","ÑöÐËÑď","ÑĚöËÒæ","ÑĚæËÞï","ÒÈùËÞĐ","ÒÈĨÊĞà","ÒÛ÷ÊĆé","ÑēïÊđę","ÑäĎÊ÷Ø","ÑäĠÊëď","ÐĤÜÊôý","ÐĤÝÊäÝ","ÐĤĀÊØÔ","Ñ÷íÊÔß","ÑĉíÊöÊ","ÒÉĆÊíĎ","ÒÉģÊÕï"],["ÜéìÓĔđ","ÜãÑÒĂĕ","ÚĈÚÒþä","ÚćēÒĕË","ÚãäÒĜĦ","ÚãÔÒĩÑ","ÙĢćÒĨæ","ÙĢèÓÜè","ØôĦÓØñ","ØóīÓĉö","ØÐêÓĈĨ","ØÎĉÔÕÐ","ØóÓÔÖÍ","ØñęÕÓÏ","ØĖÙÕÓÕ","ØĔčÖÑç","ÙĝĩÖÕå","ÙĜ÷ØÉÏ","ÚēúØËÜ","ÚĔá×ì÷","Ûÿþ×îĤ","ÛĦæÖāĪ","ÜËġÖâÉ","ÛĦøÕĩĞ","ÜíċÕáð","ÜéĦÔġÜ","ÜùþÓĪ÷","ÜéìÓĔđ"],["ÜÿėÙÔċ","ÜÿĄØĠÔ","ÜíôØğĄ","Üî×ØìĂ","ÛàĊØéĀ","Ûÿþ×îĤ","ÚĔá×ì÷","ÚēúØËÜ","ÙĜ÷ØÉÏ","ÙĝĩÖÕå","ØĔčÖÑç","ØĔÝÖĚÞ","ØĂËÖęď","ØāĘ×Íă","ØËÍ×Øĕ","×īĒØáþ","ØÜąØâħ","ØÜ×Øć÷","ØíĠØĈÕ","ØíÏÙÔħ","ÙĚéÙÌĦ","ÙęĜÙåÿ","ÚÈÒÙåď","ÙīĂÙþß","ÙĘĝÙĖđ","ÙėÓÛÉĐ","ÚðąÛÊě","ÚĎğÚÍì","ÛâĘÚÎĢ","ÛâçÚçô","ÛćÍÚÜØ","ÛćàÚÏĩ","ÜÙāÚÝĔ","ÜÙĩÙĩä","ÜìÊÙĩĝ","ÜìëÙđï","ÜĐĉÙĒø","ÜđÈÙùĀ","Ý×āÙûÌ","ÝÞïÙċá","ÝõüÙĒĜ","ÝĊÞÙØÚ","ÜÿėÙÔċ"],["ÖĞûÛĢâ","ÖĕåÛġī","ÖĖÌÛñÍ","ÖÖąÛïà","Ö×ïÚĢß","ÓãúÚĚÑ","ÓáīÛĘó","ÑĔâÛēö","ÑđôÝčď","ÕÊãÝĘè","ÔĦăáčğ","ÕÕÍáĎć","ÕÖÉáÝĒ","Õè×áÞø","ÕéÑàđć","ÖÎúàĔ÷","ÖÐðßĖģ","ÕëÈßēĚ","ÕîĔÝęĄ","ÖÓęÝěĩ","ÖÔæÝêĢ","ÖĝÜÝíÎ","ÖĞûÛĢâ"],["ÙėÒÛÉå","ÙĘĝÙĖđ","ÙīĂÙþß","ÚÈÒÙåď","ÙęĜÙåÿ","ÙĚéÙÌĦ","ØíÏÙÔħ","ØíĠØĈÕ","ØÜ×Øć÷","ØÜąØâħ","×īĒØáþ","ØÈÊØÊë","Öĥà×īÑ","ÖĢĨÙÝÏ","ÖÚÖÙÛÉ","ÖÖąÛïà","ÖĖÌÛñÍ","ÖĖĒÚĤë","×ąëÚĦę","×ăüÜå×","ØèđÜçß","ØççÝñï","ÙËīÝóč","ÙËĖÝĤá","ÙäĀÝĤĤ","ÙàÐÞÍñ","ÙĒėÞÎæ","ÙēĉÝõØ","ÙĈêÝôğ","ÚðąÛÊě","ÙėÒÛÉå"],["ÖĢÜÖÌñ","ÖðÖÖËÐ","ÖðùÕĖĒ","ÖåĈÕĖô","ÕċēÕĔĩ","ÕċàÖÕð","ÔĂÛÕĪë","ÔĀĉ×æĄ","ÔĒė×çß","ÔĒá×ĥÓ","ÔÉãØËê","ÔÉÍØ×ÿ","ÔíÞØäĚ","ÔìàØġğ","ÔĐďØĢđ","ÔččÚĞî","ÕėÌÚġÖ","ÕęçÙòë","ÕīüÙòĞ","ÖÉĒØËĦ","ÕěĂ×ĨÑ","ÕěÞ×ăĚ","Öġ÷×öĒ","ÖĢÜÖÌñ"],["ØÌÓÖÏê","×ĝğÖÎĤ","×ĞÙÕĚĆ","ØÊßÕěÌ","ØÊĨÔĝĘ","×ğüÔĝò","×ğĝÔąÙ","ÖĥÙÔĂĕ","ÖĥøÔêú","ÖĄėÔéĄ","ÖąÖÔÑè","ÖÍÍÓĨÌ","ÖÍîÓěĀ","ÕĠĐÓěì","ÕġÕÓăø","ÕØÞÓÿÒ","ÕØÑÓĊñ","ÕüĂÓċî","ÕûĖÔÛí","ÔėÛÔÌĈ","ÔĖğÔäģ","Õ×ÞÔåġ","ÕÖÝÕÊč","ÕèïÕËÛ","ÕæěÖÕË","ÕċàÖÕð","ÕċēÕĔĩ","ÖðùÕĖĒ","ÖðÖÖËÐ","ÖģÓÖÌò","Öġ÷×öĒ","ÕěÞ×ăĚ","ÕěĂ×ĨÑ","ÖÉĒØËĦ","ÕīüÙòĞ","ÕęçÙòë","ÕėÌÚġÖ","Ö×ïÚĢß","ÖÚÖÙÛÉ","ÖĢĨÙÝÏ","Öĥà×īÑ","ØÈÊØÊë","ØÌÓÖÏê"],["Õ×ęÕÊđ","Õ×ÞÔåġ","ÓĠÓÔÖõ","ÓĢăÒÿħ","ÒīÿÒþÑ","ÒīīÒåĘ","ÒãåÒ×Ğ","ÒáĎÓÒí","ÒóĪÓÍĄ","ÒñàÔħā","ÒăôÔĨÌ","ÒāàÖýĆ","ÓèçÖÿă","ÓçÉ×ôÏ","ÔÊÉ×õĥ","ÔÉãØËê","ÔĒá×ĥÓ","ÔĒė×çß","ÔĀĉ×æĄ","ÔĂÛÕĪë","ÕçÊÖÈî","ÕèïÕËÛ","Õ×ęÕÊđ"],["ÔìĖØġġ","ÔíÞØäĚ","ÔÉÍØ×ÿ","ÔÊÉ×õĥ","ÓçÉ×ôÏ","ÓèçÖÿă","ÒāàÖýĆ","ÒāðÖñĂ","ÒÜīÖðč","ÒÝõÖÌá","ÑÔíÕġè","ÐīďÝčê","ÑđôÝčď","ÑĔâÛēö","ÓáīÛĘó","ÓãúÚĚÑ","ÔččÚĞî","ÔĐďØĢđ","ÔìĖØġġ"],["ÌćÏÝĀÎ","ÌċèÛąĜ","ÎĞÙÛčĤ","ÎğôÚĜõ","Î×ÝÚčģ","ÎØÜÙĔÉ","ÎáçÙĎč","ÎâúØđĞ","ÎĢÕØēĨ","ÎģÑ×ĕÑ","ÑÑĒ×ěę","ÑÓÌÖġö","ÐÿĠÖïà","ÏĊùÕĥÔ","ÎċġÕøï","ÎċčÕćď","ÍġěÕçÈ","ÍÔÔÕĀÖ","ÌÉûÖëġ","ÌÉâÖùÜ","ËãĘÖĚĔ","ËâÿØÜĐ","ËīÞØ×ġ","ËĩĘÙÖĤ","ÌëßÙØè","ÌéĘÙýð","ËĩÒÙĈÜ","ËĨêÚÔĜ","ËĄâÚÓü","ËĂĠÚĐà","ËħñÚđĒ","ËĢėÝýÙ","ÌćÏÝĀÎ","ÍôãØĐâ","ÍóēÙÚĠ","ÌďĆÙØæ","ÌĕæØČĔ","ÍôãØĐâ"],["ØòĝÖèč","ØñØÕăđ","ØÞĦÕăá","ØàÛÔĆÒ","×ĩËÔąñ","×ĩâÔíÖ","×èĀÔëĆ","×èġÔÓ×","ÖėçÔÑĘ","ÖėÐÓĝ÷","ÖáÖÓĜÉ","ÖáĪÓëæ","ÖĆñÓìç","ÖþðÒÖø","Öĩ÷Ò×Ă","ÖĥčÑÚá","×ïĀÐĩĨ","×ðďÐíę","×ÌÚÐèú","×ÌÔÐÜĚ","ÖÕÝÐÛÌ","Ö×čÎùù","ÕĄåÎÿġ","ÕĄĊÎßá","ÕòØÎÞğ","ÕòÛÎ÷ī","ÕÍĪÎ÷Ï","ÕÌÏÐØĔ","ÔċčÐ×Ħ","Ôċ÷Ðäú","ÔĝĊÐäĢ","ÔĝáÐüĕ","ÔøýÐćĜ","ÔĄúÐĘú","ÔøãÐħĦ","ÔöàÑĨó","Ô÷ĠÒÐĘ","ÔęďÒÑħ","ÔęèÒâæ","ÔīĞÒëĥ","ÔĩÜÔÙä","ÕûĖÔÛí","ÕüĂÓċî","ÕØÑÓĊñ","ÕØÞÓÿÒ","ÕġÕÓăø","ÕĠĐÓěì","ÖÍîÓěĀ","ÖÍÍÓĨÌ","ÖąÖÔÑè","ÖĄėÔéĄ","ÖĥøÔêú","ÖĥÙÔĂĕ","×ğĝÔąÙ","×ğüÔĝò","ØÊĨÔĝĘ","ØÊßÕěÌ","×ĞÙÕĚĆ","×ĝğÖÎĤ","ØÌÓÖÏê","ØËÍ×Øĕ","ØāĘ×Íă","ØĂËÖęď","ØĔÝÖĚÞ","ØĔĈÖéĕ","ØòĝÖèč"],["ÑÓÌÖġö","ÑÔíÕġè","ÑĝàÕģÛ","ÑĝËÖËè","ÒÝõÖÌá","ÒÜīÖðč","ÒāðÖñĂ","ÒăôÔĨÌ","ÒñàÔħā","ÒóĪÓÍĄ","ÒáĎÓÒí","ÒãåÒ×Ğ","ÑĢĚÒÖĨ","ÑģÊÒÉī","ÏÉÜÑĤĕ","ÏÏÊÒàÉ","ÎĠÿÔĎĩ","ÎćĔÔĠó","ÍăâÔĢï","ÍùćÔĨĠ","ÍøģÕöÍ","ÍġěÕçÈ","ÎċčÕćď","ÎċġÕøï","ÎĦøÕĂð","ÐòĦÖçÔ","ÑÓÌÖġö"],["ÜďĢÚČú","ÜďīÚßï","ÜëďÚÞæ","ÜëğÚÒ×","ÜÙęÚÑą","ÜÖġÚÝď","ÛćàÚÏĩ","ÛćÍÚÜØ","ÛâçÚçô","ÛâĘÚÎĢ","ÚĎğÚÍì","ÙĈêÝôğ","ÜċħÝýĐ","ÜďĢÚČú"],["ÙËĕÝģõ","ÙËīÝóč","ØççÝñï","ØèđÜçß","×ăüÜå×","×ąëÚĦę","ÖĖĒÚĤë","ÖĝÜÝíÎ","ÖÔæÝêĢ","ÖÓęÝěĩ","ÕîĔÝęĄ","ÕëÈßēĚ","ÖÐðßĖģ","ÖÎúàĔ÷","ÕéÑàđć","Õè×áÞø","ÕÖÉáÝĒ","ÕÕÍáĎć","ÔĦăáčğ","ÔģôãĊđ","×êòãĒĥ","×øùãæþ","×ĀêÞĞË","ØğāÞġô","ÙÖÒÞÍÞ","ÙäĀÝĤĤ","ÙËĕÝģõ"],["ßàÕÝÔØ","ß×ÌÝÓĜ","ßØĠÛĉô","ÞĪĠÛĆč","ßËþÚÚÚ","ÞģëÚÙĜ","ÞģĆÙĥé","ÞÚĕÙĢĊ","ÞÛĂÙÙĒ","ÝĊÞÙØÚ","ÝõüÙĒĜ","ÝÞïÙċá","Ý×āÙûÌ","ÜđÈÙùĀ","ÜĐĉÙĒø","ÜìëÙđï","ÜìÊÙĩĝ","ÜÙĩÙĩä","ÜëďÚÞæ","ÜďīÚßï","ÜċħÝýĐ","ÞÖÎÝĂù","ÞÓīßÌÈ","ÞěĥßÎđ","ÞĜĒÞúÔ","ßÝĖÞûù","ßàÕÝÔØ"],["ÞĩĞÔåĦ","ÞâÉÔãĝ","ÞâçÔÎê","ÝþÉÔËë","ÝÿČÒąç","ÜãÑÒĂĕ","ÜæßÓĆĥ","ÜùþÓĪ÷","ÜéĦÔġÜ","ÜíċÕáð","ÛĦøÕĩĞ","ÜÊčÖéĎ","ÛàĊØéĀ","ÝÓúØîã","ÝÓĀØØÌ","ÞċĔØÜì","ÞČÔ×ħğ","ÞĥĒ×Ĩø","ÞĦĢ×ßß","Þčá×Þû","ÞčÈ×îô","Þòå×Ď÷","ÞÝå×ĎÑ","ÞÜĦ×Ħā","ÝĠù×ĥď","ÝĜÎ×ôĔ","ÝøĖ×ôò","ÝûĈÕþî","ÝĠčÕÞě","ÝġÙÔĕÏ","ÞáàÔĔĜ","ÞàôÕáø","ÞċăÕâĚ","ÞĊĚÕăī","ÞøÓÕăĖ","Þ÷øÕīó","ÞďÑÖÈÙ","ÞĎēÖßĪ","ÞĨ÷ÖàĊ","ÞĩĞÔåĦ"],["ãěĎÚėÝ","ãěêÚéĕ","äÚ×Úçé","äÎĘÚÍé","ãĞħÚÌą","ãĞĔÚâġ","ãöĐÚåÉ","ãöÕÚĖÈ","ãÑüÚĥ÷","ãÒĂÙĚû","âĀÜÙĘě","âāñØÿê","âïÖØþĩ","âÝÖØåĢ","áēêØäđ","áĉĪØĕē","áĒĠØĕī","áĒñÙãß","á÷æÙâĂ","áøÉØüć","áåĚØüÚ","áåĄØĔĝ","áÓùØĔð","áÓćØûĒ","àĥāØûÒ","àĥēØâÿ","àĜċØâæ","àĞÜ×äñ","àčħ×ãĨ","àĠØÖÖõ","àýüÖÕú","àúùØùà","àċħØúô","áÒĔÙāĖ","áÒâÙīĨ","áãāÙīĪ","áĨýÛđõ","âĐÎÛđĉ","ãâõÛĪä","ãâÿÛğā","ãćÙÛĠĉ","ãćĄÛûĩ","ãęĢÛüü","ãĚÝÛäÎ","äíÊÛåÿ","äíćÚĘč","ãěĎÚėÝ"],["âÓéÓåĪ","áĤĀÓåÛ","áĥÈÓËõ","áÜóÓÈĎ","áÛÊÔÈġ","àħĞÓīò","àČĄÓĎõ","àĊēÔÊë","ßĐċÓīĦ","ßĐñÔÚĉ","ßÝïÔ×Ď","ßÝÊÔòë","ßďĝÔÿĈ","ßĎćÕæÑ","ßèïÕäğ","ßçāÕĕý","ßčĞÕĖï","ßþĄ×àė","àÌå×âÎ","ßĢĩÙÞÞ","àÑĂÙÞđ","àÐĔÙĨÿ","ßĚČÙħĘ","ßĚñÚÜí","àāþÚÞĉ","àāÊÚďö","àìâÚĎĤ","àëÉÛČú","àÎûÛċğ","àÑÖÜØĐ","áĆĦÜÝØ","áĆýÜõē","âØĢÜ÷ä","âÙâÜáę","áãāÙīĪ","áÒâÙīĨ","áÒĔÙāĖ","àċħØúô","àùĜØóæ","àýüÖÕú","á×ÝÖçă","á×ĂÖÏĐ","áòğÖÏğ","áòõÖèê","áčďÖéÓ","áĎëÕħī","áĠÎÖßû","áġĀÕèĤ","áĆĄÕÔø","áêÒÔìĨ","âćċÔñï","âĈĉÓĤĪ","âÚĦÓģĉ","âÎùÓĒî","âöāÓČß","âöġÓôÉ","âĉĆÓôă","âĊÐÓÍĖ","âçÕÓÌđ","âæČÓæė","âÓéÓåĪ"],["áÍîÜÛï","àÑÖÜØĐ","àÎûÛċğ","àëÉÛČú","àìâÚĎĤ","àāÊÚďö","àāþÚÞĉ","ßĚñÚÜí","ßĚČÙħĘ","ßĈøÙħä","ßĈđÙĎē","ßíçÙčĪ","ßíÏÙõÓ","ßäĀÙõÈ","ßäàÙčē","ÞĈÿÙċģ","ÞĈěÙóñ","ÞÿđÙóÙ","ÞĉéØĦõ","ÞĤćØħõ","ÞĤñÙÛČ","ßÖäÙÜÜ","ßÖÿØħę","ßîÙØĨü","ßîóØđÝ","ÞĉăØĎÝ","ÞĀĨØÜÐ","ÝÓĀØØÌ","ÝÓúØîã","Üî×ØìĂ","ÜíôØğĄ","ÜÿĄØĠÔ","ÜÿãÙÔĉ","ÞÛĂÙÙĒ","ÞÚĕÙĢĊ","ÞģĆÙĥé","ÞģëÚÙĜ","ßËþÚÚÚ","ÞĪĠÛĆč","ßØĠÛĉô","ß×ÌÝÓĜ","ßàÕÝÔØ","ßÝĖÞûù","ßÔēÞû×","ßÊħßÏâ","ßĂÛßÑê","ßā×ßĢÿ","ßĩËßģĥ","ßĨĚàÐč","à÷íàÒø","àóċßìĦ","áËāßïÚ","áÌÓÞĉđ","àùĐÞąÜ","àùĥÞïé","áÌèÞñá","áÍîÜÛï"],["äèėáÙÝ","äåĆàĤĕ","ãĥÕàģý","ãĤþáãī","ãĆçáâĩ","ãøĖàýï","ãāßàýĐ","ãĂąàÙÞ","ãòÏàØā","ãèħßċî","ãËõßĊÞ","ãÌðà×ā","ßĨĚàÐč","ßĩËßģĥ","ßā×ßĢÿ","ßĂÛßÑê","ßÊħßÏâ","ßÔēÞû×","ÞĜĒÞúÔ","ÞěĥßÎđ","ÞÓīßÌÈ","ÞÑÎáÈÎ","â÷ÉáÖĊ","âõħâÐč","åÉÐâØĕ","åÉēáČÙ","åÜÊáČĖ","åÜĎáÜÚ","äèėáÙÝ"],["åĚĔÛĂà","åĈýÛāď","åĈíÛčĤ","åáĞÛĉÏ","åÖĄÛöā","åËĒÛĂé","åÈħÛçæ","äĚēÛæĘ","äĐĝÛģċ","ãâÿÛğā","ãâõÛĪä","âĐÎÛđĉ","áĨýÛđõ","âüÖÝÕĠ","âġøÜĨë","âġêÝÐċ","ãáÍÝÑć","ãàĤÝÝħ","ãąýÝßÊ","ãĆęÜØĝ","åÐĖÜå÷","åÐīÜÍÑ","åïýÛğć","åďğÜðû","åćËÜùý","åĐÐÜėĐ","åýĞÜėã","åýýÝÌĊ","åĘěÝÍö","åĘëÝòñ","åóĤÝñè","åòÓÞĔā","åßĠÞēğ","åÝĊà÷ç","äċÏàéå","äċĜßĐÊ","ãĦĤßčë","ãĥüàċÝ","äÓĔàċĜ","äÓĄàĘÈ","ãēÓàĖď","ãĒģàĢğ","äåĆàĤĕ","äåçáÙÐ","åîħáÜĚ","åñ×ßúÌ","åúäßúð","åúĤßÉï","åĄÌßÉċ","åĄĪÞãĜ","æ×ďÞåè","æÙėÜĈĩ","æþðÜĊÐ","æþĄÜùĒ","æĐĘÜúÌ","æéĘÛăĨ","åĚĔÛĂà"],["åĀñÝÌĒ","åýĞÜėã","åĐÐÜėĐ","åćËÜùý","åďğÜðû","åïýÛğć","åÐīÜÍÑ","åÐĖÜå÷","ãĆęÜØĝ","ãąýÝßÊ","ãàĤÝÝħ","ãáÍÝÑć","âġêÝÐċ","âġøÜĨë","âüÖÝÕĠ","ãÞģÞĤò","ãăìÞĦù","ãăÍßÛÑ","ãħþßÜÕ","ãĦĤßčë","äċĜßĐÊ","äċÏàéå","åÝĊà÷ç","åßĠÞēğ","åòÓÞĔā","åóĤÝñè","åĘëÝòñ","åĘěÝÍö","åĀñÝÌĒ"],["æàíÖ÷á","åğĢÖöæ","åğđÖĂù","åûôÖõå","åąÚÖÊČ","åüÔÕĨĠ","åüĝÕøì","äĘËÕõĕ","äĘĝÔĩâ","äëøÔħĎ","äêăÕôÊ","äÝČÕóĎ","äÏïÕóÜ","äÐßÔĦĘ","ãýĎÔĤħ","ãüČÕĉĚ","ãąĠÕĢü","ãáÏÕġÝ","ãàÍÖÉà","ãÒĘÕħđ","ãØåÕĎï","ãÍäÕúØ","ãÛČÕèÍ","ãêęÕðĞ","ãëüÔĤê","âģĚÔĢė","âĎüÔýĝ","âćÝÔčđ","âïęÔčÎ","âðàÔðĖ","áêÒÔìĨ","áĆĄÕÔø","áġĀÕèĤ","áĠĀÕĜħ","âĩõÖçÈ","âĩïÖĄĪ","âĄôÖĄÉ","âĂğ×āĒ","áĔĈ×ÿñ","áĕË×æĩ","áùĪ×æß","áúąÖĥĀ","áèêÖĥÏ","áçī×Ùû","áÕė×Øī","áËÚØÊî","áÔèØÊĈ","áÓĢØãÒ","áāðØäã","áāĖØËĕ","áĝÐØÌ÷","áĝþ×ĘÏ","âĢå×Ěğ","ãæ×Øèĕ","äËøØëÑ","äÌØ×ĞÍ","äïÓ×ÿĐ","äëè×ïċ","åÕĕ×ñÌ","åÕÛ×ġĔ","åçÕØÖö","åĂòØ×Ö","åĂÕØîÎ","æËĊØðđ","æÍòÖĦğ","æßĒÖħġ","æàíÖ÷á"],["çÒĞÙÊě","æüđÙãÕ","åĚÕÙÓö","åøĒØĜê","åøðÙìĢ","äğĞÙë×","åõúÚë÷","æÕĉÚìď","æïÝÚĒÖ","æĥÞÚēø","æĤĞÚīĤ","çÓÍÛÈą","çÒĢÛÔĝ","æđøÛàÊ","æĚÌÛìú","æĒÍÛìã","æđĚÛĄĔ","æĤÉÛąá","æģĕÛùý","çÏĒÛĒÈ","çÒÞÛąě","èíčÛĉĈ","èîīÚóï","éÓħÚõø","éÔÝÚÍĤ","èĂĉÙĝď","çěĖÙÕô","çÒĞÙÊě"],["ÎĠÍÓüæ","ÎàÔÓúĂ","ÎâÔÑĥĢ","ËêđÑĝá","ËêÎÒõä","ÊàĩÒñě","ÊßčÓúÌ","ÉîöÓ÷á","ÉìÊÓÓÓ","ÉãĨÓÔô","ÉæĕÔäÿ","ÉĞÎÔæĜ","ÉĞĤÓĐĠ","ÊăğÓēè","ÊāĚÕĎÙ","ËåģÕĐè","ËäĝÖâî","ËÖÒÖçě","ËØëÖòď","ËäĈÖîÚ","ËãĘÖĚĔ","ÌÉâÖùÜ","ÌÉûÖëġ","ÍøħÕòö","ÍùćÔĨĠ","ÍăâÔĢï","ÎęìÔėû","ÎħĠÔïë","ÎĨĨÓüü","ÎĠÍÓüæ"],["æĥøÚīĪ","æĥÞÚēø","æïÝÚĒÖ","æÕĉÚìď","åõúÚë÷","äèéØìÒ","äÝćØëĔ","äÜĕÙéç","âĦûÙåĈ","âĥĠÙúĄ","âĀõÙù÷","âĀÜÙĘě","ãÒĂÙĚû","ãÑüÚĥ÷","ãöÕÚĖÈ","ãöĐÚåÉ","ãĞĔÚâġ","ãĞħÚÌą","äÎĘÚÍé","äØäÚÜò","äÚ×Úçé","ãěêÚéĕ","ãĚĚÚėÚ","äíćÚĘč","äíÊÛåÿ","ãĚÝÛäÎ","ãęĢÛüü","ãćĄÛûĩ","ãćÙÛĠĉ","äĐĝÛģċ","äĚēÛæĘ","åÈħÛçæ","åËĒÛĂé","åÖĄÛöā","åáĞÛĉÏ","æéĘÛăĨ","æöÕÛďĖ","æíĀÛ÷ÿ","æđīÛøý","æĚÌÛìú","æđøÛàÊ","çÒĢÛÔĝ","çÓÍÛÈą","æĥøÚīĪ"],["çøÏçáĊ","çøĝæĝõ","æĔÓæĔĄ","æęÿäÿĞ","æòĩäþÙ","æõāãÜÉ","æÑâãÚþ","æÓČáĐð","åēÉáĎğ","åēăáÞà","åÜĎáÜÚ","åÜÊáČĖ","åÉēáČÙ","åÉÐâØĕ","âõħâÐč","âòĞäØÔ","äīĂäàģ","äĩĄåÞā","åéĞåßĞ","åãèèþĠ","åñüèĐė","æùçéÐË","æČĨèīð","æĎĞèàė","çÓêèàĐ","çÒâéñÙ","çäćéöá","è×ěéÏġ","èÜôçáù","çøÏçáĊ"],["ãĨÕàċæ","ãħþßÜÕ","ãăÍßÛÑ","ãăìÞĦù","ãÞģÞĤò","âÙâÜáę","âØĢÜ÷ä","áĆýÜõē","áĆĦÜÝØ","áÐ×ÜÛ÷","áÌèÞñá","àùĥÞïé","àùďÞćē","áÌÓÞĉđ","áËāßïÚ","àóċßìĦ","à÷íàÒø","ãÌðà×ā","ãËõßĊÞ","ãèħßċî","ãòÏàØā","ãĂąàÙÞ","ãāßàýĐ","ãøĖàýï","ãĆçáâĩ","ãĤþáãī","ãĥÕàģý","ãĒģàĢğ","ãēÓàĖď","äÓĄàĘÈ","äÓĔàċĜ","ãĨÕàċæ"],["èÍĕáæï","èÌĄàāÌ","çĞġàĀ÷","çğÞàèÈ","çăçàçÒ","çĄ÷ßèþ","æèĖßäô","æéġÞæÐ","æĠĉÞçĐ","æġÝÝĜġ","çąīÞÑĉ","çćïÜĝĠ","çÉöÜěđ","æđôÜêä","æĐĘÜúÌ","æþĄÜùĒ","æþðÜĊÐ","æÙėÜĈĩ","æ×ďÞåè","åĄĪÞãĜ","åĄÌßÉċ","åúĤßÉï","åúäßúð","åñ×ßúÌ","åîħáÜĚ","åēăáÞà","åēÉáĎğ","æÓČáĐð","æÑâãÚþ","æõāãÜÉ","æòĩäþÙ","æęÿäÿĞ","æĚÔäçì","æĥÕäçĂ","çþĕãÉħ","çĀĈââĐ","èîĒââï","èðÉáåĘ","èÍĕáæï"],["ëãÑÛĞÿ","êĀĕÛĐà","êĂèÚùĄ","éĝãÚãč","éĝ×Ú÷ô","êÝèÚĈÌ","éĜĞÚďč","éĜÿÚĨÑ","éøÌÚħÊ","éøýÚĂÿ","éæÚÚĂÒ","éæáÚõĥ","èîīÚóï","èíčÛĉĈ","çÒÞÛąě","çÏĒÛĒÈ","æģĕÛùý","æĤÉÛąá","æđĚÛĄĔ","æđīÛøý","æíĀÛ÷ÿ","æñĕÛĖÌ","çÉöÜěđ","çõÙÜĝÍ","çõìÜČč","çćāÜčÚ","çćĒÜÿĄ","èÛãÝìæ","èëÿÝĄè","èêĔÞëġ","êýöÞñĥ","êāìÞčĢ","ëãðÞĂú","ëãÑÛĞÿ"],["ëīġÖ×ē","ëīíÕĦĔ","ëěĀÕĦÒ","ëĄþÕĉĞ","ëÚÝÕćâ","ëÙėÖÔÌ","êīôÖÓø","êġþÖăĩ","éØîÖòĜ","é×Þ×ÞĒ","éÉĨ×Þé","éÉē×ëÑ","é×É×íü","éÕïØúÚ","èĜćØùÜ","èěĦØĪÙ","èðÛØĨĉ","èïĆÙčó","éÔÝÚÍĤ","éÓħÚõø","éøýÚĂÿ","éøÌÚħÊ","éĜÿÚĨÑ","éĜĞÚďč","êÝÝÚĐĦ","êÝìÚāħ","éĝ×Ú÷ô","éĝãÚãč","êĂèÚùĄ","êăçØėĊ","êĔĪØĘÝ","êĕĆØçâ","êħęØçę","êĩĥ×Ôþ","ëĘÌ×ÒÓ","ëĘğÖćě","ìÐÝÖĈĄ","ìÑÑÖØÊ","ëīġÖ×ē"],["ëđďíõú","ëčĥíéÐ","ëăėíéá","ëïÒìÐã","ëÍöìÌÒ","ëÎĕëĆÞ","êÓØëãĖ","êÓøëÙà","éÝÌêħĪ","éÜúëÙú","èĥäëÙĄ","èĥÓéĖĔ","éĉöéÙô","êôīéÙÊ","éīĀåģĦ","ëßčåĐď","ìČÌåďÜ","ìČéåÿĨ","íðġåĎĕ","íñĉäàÛ","ëĆĜäââ","ëčğãčö","ëþèãýø","ëþüãæÑ","ëćğãåģ","ëĂöâĉ×","ëīõáĖĎ","ìĒôâõĢ","ìĒïáûé","íÐġáùď","íÐéáäï","ìĒåáåÜ","ìĒÍàĤØ","ìËÐàúî","ëğĐàØĆ","ìÉýàêÒ","ìíčàéå","ìíÛßēç","ëďêßęí","ëãøÞğċ","ëãðÞĂú","êĨùÞĊč","ëà×ßâÝ","ëÐĔßïÎ","ëóĎßĢī","ëÐĉàËĀ","êêìßĉÌ","êçÜßĔĤ","êāÑßěû","êøÌàÈÞ","êþāàãć","êòÛàîç","êùĞàĐċ","êČËàċù","êĝčàħĎ","ëÌÙàĐÉ","ëÝĘàĖĔ","ëäËâéÒ","èóëâîĔ","èíÙäæß","èīĝäåê","èĩìåãĜ","èąÏåäÜ","èĄÿåøþ","èĨĎåüĉ","èĝËæēĨ","éÐ×æĦĦ","éÏČçßÐ","éÉíçĒÞ","èĤëçĒÙ","èĤģçîÉ","èĀėçáÙ","èÿĢçĒĀ","èĒÞçĒò","èđíèàÉ","èÚþèàí","è×ěéÏġ","èĊ×éÈÊ","èėĈéÔå","èČčé÷ġ","èğČéĕč","èěÊëĊð","çâ÷ëĊÿ","çêĪìğĊ","æĆñìğô","æĄĉíĨó","æĒđïÍĪ","çÞĤïÒħ","çëĪïĂċ","çîçïĘî","æĥÜïĘì","çËÓðÞÜ","çôĈðÞà","çýġðėù","èÊöðęÝ","èÊ÷ñÎî","èÞĐñÎç","çĩèñÿĝ","êġîñāĩ","êġĘñöČ","ëþğñÕĤ","ëħđðĆĎ","ëĔýðĆæ","ëĉĖïćě","ìÌÈïćĖ","ìÍÞîĨî","ìñýîĨÚ","ìÍëîĠĦ","ìÎĨîëñ","ìóčîë÷","ìôîîØÙ","ìÓùíÉĆ","ëęÿíÊÕ","ëĦêìĕā","ëĞĒìĂĈ","ëĕ÷ìĆü","ëđďíõú","ëĔīíĀå","ëĦĒíĚď","ëĢÏíīå","ëĔīíĀå","éĢïæĢĖ","éęÞçÑï","éăòçÑċ","éĄ÷æ÷â","éõĎæïù","éëđæĂĢ","éàÎæþď","éßîæĦĞ","éÕĉæĦġ","é×ÞæÊĥ","éĝðåĥğ","éđĊæðË","éĤġæðõ","éĢïæĢĖ","ìÐďðĥü","ëćĝñÑĆ","ìëĪñÓÿ","ììÝðĦ÷","ìÐďðĥü","ëëÿñĂĘ","ëĆìñăę","ëćìñÒÓ","ëðéñå÷","ëëÿñĂĘ"],["àĊēÔÊë","àČĄÓĎõ","àħĞÓīò","áÛÊÔÈġ","áÜóÓÈĎ","áċĐÓÊù","áčõÒğÛ","âĊÑÒĢÚ","âĊĎÒ÷ý","áĥġÒõõ","áĨĦÑĦĪ","áĒĥÑĕë","áċĈÑýý","àĝĔÐħý","àğĒÐĖĩ","áØēÐĄÝ","áÚÚÏĚĥ","àğÔÏĚÛ","àĝĥÐĀġ","àĔČÐĀć","àĖĢÏĉĚ","àĕÝÏôØ","àČĩÏóģ","àĈĄÐþÊ","àøíÐýý","àñÝÐëÜ","àíąÏěâ","àêÙÐāÕ","ßħãÐĂý","ßħÎÐĞË","ßđúÑßâ","ÞğôÑÜħ","ÞĞĄÑĈĄ","ßíėÑĉô","ßëĊÒħĨ","ßđĥÒĨģ","ßđÏÓĎĄ","ßăĕÓīù","àĊēÔÊë"],["ãàÍÖÉà","ãáÏÕġÝ","ãąĠÕĢü","ãüČÕĉĚ","ãýĎÔĤħ","äÐßÔĦĘ","äÏïÕóÜ","äÝČÕóĎ","äêăÕôÊ","äëøÔħĎ","äĘĝÔĩâ","äĜĄÒĩĩ","äđØÒĉþ","ãģáÒĂö","ãĝÝÒòË","ãĖôÒý÷","ãČ×ÒëĐ","ãąĔÒ÷Ĝ","ãìĪÒâċ","ãæÚÒíā","âĤþÑģì","âĠčÑċą","âāÔÒÑĆ","áĨĦÑĦĪ","áĥġÒõõ","âĊĎÒ÷ý","âĊÑÒĢÚ","áčõÒğÛ","áċĐÓÊù","áĥÈÓËõ","áĤĀÓåÛ","âæČÓæė","âçÕÓÌđ","âĊÐÓÍĖ","âĉĆÓôă","âöġÓôÉ","âöāÓČß","âÎùÓĒî","âÚĦÓģĉ","âĈĉÓĤĪ","âćċÔñï","âðàÔðĖ","âïęÔčÎ","âćÝÔčđ","âĎüÔýĝ","âģĚÔĢė","ãëüÔĤê","ãêęÕðĞ","ãÛČÕèÍ","ãÍäÕúØ","ãØåÕĎï","ãÒĘÕħđ","ãàÍÖÉà","âĢģÑĈĊ","ãËØÑĉĝ","âĦîÑĄÍ","âĢģÑĈĊ"],["æĤĂÕËĥ","æęĂÔėë","æõäÔĖå","æõĆÔþÑ","æÑÐÔüĩ","æÊĠÔØÏ","æáùÓĐĦ","åüđÓåĚ","åûėÓÕì","åĎďÒĪċ","äėęÒĉç","äĘËÕõĕ","åüĝÕøì","åüÔÕĨĠ","åąÚÖÊČ","åûôÖõå","åğđÖĂù","åğĢÖöæ","æĄğÖøß","æąÑÖèĐ","æėëÖéÜ","æĘäÕĊĦ","æĪáÕęÙ","æĤĂÕËĥ"],["ëãĐßĘù","ëÐĔßïÎ","ëà×ßâÝ","êĨùÞĊč","êāìÞčĢ","êýöÞñĥ","èêĔÞëġ","èëÿÝĄè","çćĒÜÿĄ","çćāÜčÚ","çõìÜČč","çõÙÜĝÍ","çćïÜĝĠ","çąīÞÑĉ","æġÝÝĜġ","æĠĉÞçĐ","æéġÞæÐ","æèĖßäô","çĄ÷ßèþ","çăçàçÒ","çğÞàèÈ","çĞġàĀ÷","èÌĄàāÌ","èËćáæè","èðÉáåĘ","èîĂâîę","ëäËâéÒ","ëÝĘàĖĔ","ëÌÙàĐÉ","êĝčàħĎ","êČËàċù","êùĞàĐċ","êòÛàîç","êþāàãć","êøÌàÈÞ","êāÑßěû","êçÞßēĥ","êêìßĉÌ","ëÐĉàËĀ","ëóĎßĢī","ëëĐßđĪ","ëãĐßĘù"],["èĘĊÖÍä","èĘīÕĎÏ","èâõÕÿÙ","èâćÕñď","èčĔÕóø","èĎÎÕÝú","éÏÐÕÞü","éÏäÕÐø","èõíÕÎġ","èýÓÔÉí","èßĐÓćý","èÍ×ÒĖĆ","èíáÒČđ","çėïÒĐă","çøÕÓéá","çöþÓĆì","çăíÓČÖ","çĄùÓäĪ","çĚ×Ó×ĥ","çĕĝÓďÙ","çČÚÓęć","æøĔÓõÌ","åĔĄÒĢÞ","åĜâÓÙġ","æÓīÓçĘ","æêüÓĕí","æØēÓĒĒ","æÊĠÔØÏ","æÑÐÔüĩ","æõĆÔþÑ","æõäÔĖå","æęĂÔėë","æęëÔħØ","æīëÕÌÔ","æĪáÕęÙ","çĎĚÖÚÝ","çĎĦÖÐÊ","èóĎÖÜĊ","èóàÖýÎ","èĩĞÖþô","éÐÈÖÍħ","éØħÖÎÛ","éÙĎÕāé","èĢĤÕĀĆ","èĢØÖÍ÷","èĘĊÖÍä","èîĐÒČć","èïĠÒĖì","èñïÒČõ","èîĐÒČć"],["éÍèÖþĂ","èóàÖýÎ","èóĎÖÜĊ","çĎĦÖÐÊ","çčÜÖÙđ","æĘäÕĊĦ","æėëÖéÜ","æąÑÖèĐ","æĄğÖøß","æàíÖ÷á","æßĒÖħġ","æÍòÖĦğ","æËĊØðđ","åùÏØíĖ","åùÌØĝå","åĚÕÙÓö","æþýÙãç","æĥčÙÌÞ","çĊāÙÍĤ","èïĆÙčó","èðÛØĨĉ","èěĦØĪÙ","èĜćØùÜ","éÕïØúÚ","é×É×íü","éÉē×ëÑ","éÉĨ×Þé","é×Þ×ÞĒ","éØÛÖþę","éÍèÖþĂ"],["ëìēÕåæ","ëÚÿÕäĔ","ëÚďÕÖø","ëÈõÕÕĤ","êĨĀÕÉõ","êîýÕÉē","êÓĎÔČô","êÚðÔüÛ","éùÌÔćò","éèğÔôď","éèāÔÛĚ","èĝõÔÜĒ","èýÓÔÉí","èõíÕÎġ","éÏäÕÐø","éÏÐÕÞü","èĎÎÕÝú","èčĔÕóø","èâćÕñď","èâõÕÿÙ","èĘīÕĎÏ","èĘôÖÍó","èĢØÖÍ÷","èĢĤÕĀĆ","éÙĎÕāé","éØħÖÎÛ","éÐÈÖÍħ","èĩĞÖþô","éûėÖñï","êġþÖăĩ","êīôÖÓø","ëÙėÖÔÌ","ëÚÝÕćâ","ëÈÈÕĆđ","ëÈÕÕúÖ","ëìúÕûý","ëìēÕåæ"],["íċÏÖÈč","ìĒđÕČę","ìßöÕÑå","ìÒćÕèĠ","ëëĄÕËħ","ëÈðÕÌć","ëÚďÕÖø","ëÚÿÕäĔ","ëìēÕåæ","ëìúÕûý","ëÈÕÕúÖ","ëÈÈÕĆđ","ëĄþÕĉĞ","ëěĀÕĦÒ","ëīíÕĦĔ","ëīÎÖ×Đ","ìÑÑÖØÊ","ìÐÝÖĈĄ","ëĘğÖćě","ëĘÌ×ÒÓ","ëĪ××Òć","ëħþ×ÿê","ìĔċ×ġÜ","ìĕãØąÖ","íùēØĄñ","íøéÖġĝ","íĜĞ×åß","íěħÖÑĥ","íċÏÖÈč"],["í÷ñØĄô","ìĕãØąÖ","ìĔċ×ġÜ","ëħþ×ÿê","ëĪ××Òć","êĩĥ×Ôþ","êħęØçę","êĕĆØçâ","êĔĪØĘÝ","êăçØėĊ","êĀĕÛĐà","ëãÑÛĞÿ","ëäëÚýÝ","íõĖÚøę","í÷ñØĄô"]];
window.decodedWardPaths = _.map(encodedWardPaths, function(ward) {
    return _.map(ward, function(point) {
        return window.decodePoint(point);
    });
});
window.wardPaths = _.map(decodedWardPaths,function(ward) {
    return _.map(ward, function (point) {
        return window.convertPoint(point);
    });
});

// ANGULAR

var dateMapApp = angular.module('dateMapApp', []).value('$anchorScroll', angular.noop);

dateMapApp.config(function($routeProvider) {
    $routeProvider.
        when('/', {
            action: "yesterday"
        }).
        when('/:date/', {
            action: "date"
        }).
        when('/:date/:serviceSlug/', {
            action: "date.service"
        }).
        otherwise({
            redirectTo: '/'
        });
});

dateMapApp.factory('Data', function () {
    var data = {
    };

    if (!window.chicagoMap) {
        window.chicagoMap = L.map('map',{
            scrollWheelZoom: false,
            zoomControl: false
        }).setView([41.80, -87.815], 11);

        L.tileLayer(
                'http://{s}.tile.cloudmade.com/{key}/{styleId}/256/{z}/{x}/{y}.png',
                _.extend(window.mapOptions, {'maxZoom': 11})
            )
            .addTo(window.chicagoMap);
    }

    data.setDate = function(date) {
        data.date = date.format(dateFormat);
        data.dateISO = date.format();
        data.dateFormatted = date.format('MMM D, YYYY');

        data.prevDay = moment(date).subtract('day',1);
        data.nextDay = moment(date).add('day',1);
        data.prevDayFormatted = data.prevDay.format('MMM D');
        data.nextDayFormatted = data.nextDay.format('MMM D');
        data.isLatest = data.nextDay.isAfter(window.yesterday);
    };

    return data;
});

dateMapApp.controller("headCtrl", function ($scope, Data) {
    $scope.data = Data;
});

dateMapApp.controller("dateCtrl", function ($scope, Data, $http, $location, $route, $routeParams, $timeout) {
    var wardColors = [
        '#182A35',
        '#244153',
        '#315971',
        '#3C7090',
        '#4888AF',
        '#629CBF'
    ].reverse();

    var urlSuffix = function() {
        return $routeParams && $routeParams.serviceSlug ? Data.serviceObj.slug + '/' : '';
    };

    $scope.goToPrevDay = function() {
        if (Data.prevDay.isBefore(window.earliestDate)) {
            return false;
        }
        $location.path(Data.prevDay.format(dateFormat) + '/' + urlSuffix());
    };

    $scope.goToNextDay = function() {
        if (Data.isLatest) {
            return false;
        }
        $location.path(Data.nextDay.format(dateFormat) + '/' + urlSuffix());
    };

    $scope.clickService = function(service) {
        if (service.Slug == Data.serviceObj.slug) {
            document.location = "/service/" + service.Slug + "/";
        } else {
            $location.path(Data.date + "/" + service.Slug + "/");
        }
    };

    $scope.serviceClass = function(service) {
        var classes = [];
        if (service.Slug == Data.serviceObj.slug) {
            classes.push('active');
            if (service.Slug == $routeParams.serviceSlug) {
                classes.push('in-url');
            }
        }
        if (service.Slug == Data.maxService.Slug) {
            classes.push('max');
        }
        if (service.Count > service.Average) {
            classes.push('up');
        } else if (service.Count < service.Average) {
            classes.push('down');
        }
        return classes.join(" ");
    };

    var renderMap = function() {
        var serviceObj = _.find(Data.serviceList, function(obj) {
            return obj.Slug == Data.serviceObj.slug;
        });

        var allCounts = _.toArray(serviceObj.Wards);
        var maxCount = _.max(allCounts);
        var hasRanges = maxCount >= wardColors.length;

        var grades = _.range(0, Math.min(wardColors.length, maxCount + 1));
        if (hasRanges) {
            grades = _.map(grades, function (grade) {
                return Math.round(grade * maxCount / (grades.length - 1));
            });
        }

        var allColors = _.map(allCounts, function(count) {
            // Shift the count to be between grades, find the index (which'll never be 0), then move it back one slot.
            var pos = _.sortedIndex(grades, count + 0.1) - 1;
            return wardColors[pos];
        });

        if (window.allWards) {
            window.allWards.clearLayers();
        } else {
            window.allWards = L.layerGroup();
        }

        var wardClick = function(e) {
            document.location = 'ward/' + e.target.options.id + '/#' + $location.path();
        };

        $timeout(function() {
            for (var path in window.wardPaths) {
                var wardNum = parseInt(path,10) + 1;
                var wardCount = serviceObj.Wards[wardNum];
                var poly = L.polygon(
                    window.wardPaths[path],
                    {
                        id: wardNum,
                        opacity: 1,
                        weight: 1,
                        dashArray: '3',
                        color: 'white',
                        fillOpacity: 0.8,
                        fillColor: allColors[wardNum-1]
                    }
                )
                .bindLabel('<h4>Ward ' + wardNum + '</h4>' + wardCount + ' request' + window.pluralize(wardCount))
                .on('click', wardClick);
                window.allWards.addLayer(poly);
            }

            if (window.legend) {
                window.legend.removeFrom(window.chicagoMap);
            }
            window.legend = L.control({position: 'topright'});

            window.legend.onAdd = function(map) {
                var div = L.DomUtil.create('div', 'legend');
                var labels = _.map(grades, function (grade, i) {
                    return '<i style="background:' + wardColors[i] + '"></i> <b>' + grade + (hasRanges && grade < _.last(grades) ? '+': '') + "</b> request" + (grade == 1 && !hasRanges ? '' : 's');
                });

                div.innerHTML =
                    '<h4>' + Data.serviceObj.name + '</h4>' +
                    '<div class="colors">' +
                    labels.join('<br>') +
                    '</div>' +
                    '<div class="item delta-up">Above-average</div>' +
                    '<div class="item delta-up greatest">Greatest change</div>'
                    ;
                return div;
            };

            window.allWards.addTo(window.chicagoMap);
            legend.addTo(window.chicagoMap);
        });
    };

    var changeDate = function() {
        var countsURL = window.apiDomain + 'requests/counts_by_day.json?day=' + Data.date + '&callback=JSON_CALLBACK';

        $http.jsonp(countsURL).
            success(function(response, status, headers, config) {
                Data.reponse = response;

                var serviceCollection = _.map(_.pairs(response), function(pair) {
                    service = _.find(serviceTypesJSON, function(obj) { return obj.code == pair[0]; });
                    return _.extend(pair[1], {
                        "Code": pair[0],
                        "Slug": service.slug,
                        "Name": service.name,
                        "AvgRounded": Math.round(pair[1].Average * 10) / 10,
                        "Percent": Math.min(Math.round((pair[1].Count - pair[1].Average) * 100 / pair[1].Average), 100)
                    });
                });

                Data.serviceList = _.sortBy(serviceCollection, function(obj) {
                    return obj.Slug;
                });

                Data.maxService = _.max(Data.serviceList, function(obj) { return obj.Percent; });
                if (_.isEmpty(Data.serviceObj)) {
                    Data.serviceObj = lookupSlug(Data.maxService.Slug);
                }

                renderMap();
            }
        );
    };

    $scope.data = Data;

    $scope.$on(
        "$routeChangeSuccess",
        function ($e, $currentRoute, $previousRoute) {
            Data.setDate(parseDate($routeParams.date, window.yesterday, $location));
            Data.serviceObj = {};
            Data.action = $route.current.action;
            if ($currentRoute.pathParams.serviceSlug) {
                if (Data.action == 'date.service') {
                    Data.serviceObj = window.lookupSlug($currentRoute.pathParams.serviceSlug);
                }
            }
            Data.currURL = "#/" + Data.date + "/" + urlSuffix();

            var titleParts = [];
            if (_.isEmpty($currentRoute.pathParams)) {
                titleParts.push('Chicago Works For You');
                titleParts.push('The citywide dashboard with ward-by-ward views of service delivery in Chicago');
            } else {
                titleParts.push(Data.dateFormatted);
                if ($currentRoute.pathParams.serviceSlug) {
                    titleParts.push(Data.serviceObj.name);
                }
                titleParts.push('Chicago Works For You');
            }
            Data.pageTitle = titleParts.join(' | ');

            if (!$previousRoute) {
                // First load
                changeDate();
            } else if ($currentRoute.pathParams.date != $previousRoute.pathParams.date) {
                // Going from one date to another
                changeDate();
            } else if (!$currentRoute.pathParams.serviceSlug) {
                // Going from defined date and service to the same date, but no service
                changeDate();
            } else if ($currentRoute.pathParams.serviceSlug != $previousRoute.pathParams.serviceSlug) {
                // Going from one service to another, with the same date
                renderMap();
            } else {
                changeDate();
            }
        }
    );
});
